Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_bin/prime_1_3_service_bin/firmware/src/packs/PIC32CX2051MTG128_DFP/component/adc.h
/* -------- ADC_IMR : (ADC Offset: 0x2C) ( R/ 32) Interrupt Mask Register -------- */
#define ADC_IMR_RXRDY_Pos                     _UINT32_(0)                                          /* (ADC_IMR) Receive Ready Interrupt Mask Position */
#define ADC_IMR_RXRDY_Msk                     (_UINT32_(0x1) << ADC_IMR_RXRDY_Pos)                 /* (ADC_IMR) Receive Ready Interrupt Mask Mask */
#define ADC_IMR_RXRDY(value)                  (ADC_IMR_RXRDY_Msk & (_UINT32_(value) << ADC_IMR_RXRDY_Pos)) /* Assigment of value for RXRDY in the ADC_IMR register */
#define ADC_IMR_RXEMPTY_Pos                   _UINT32_(1)                                          /* (ADC_IMR) Receive FIFO Empty Interrupt Mask Position */
#define ADC_IMR_RXEMPTY_Msk                   (_UINT32_(0x1) << ADC_IMR_RXEMPTY_Pos)               /* (ADC_IMR) Receive FIFO Empty Interrupt Mask Mask */
#define ADC_IMR_RXEMPTY(value)                (ADC_IMR_RXEMPTY_Msk & (_UINT32_(value) << ADC_IMR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the ADC_IMR register */
#define ADC_IMR_RXFULL_Pos                    _UINT32_(2)                                          /* (ADC_IMR) Receive FIFO Full Interrupt Mask Position */
#define ADC_IMR_RXFULL_Msk                    (_UINT32_(0x1) << ADC_IMR_RXFULL_Pos)                /* (ADC_IMR) Receive FIFO Full Interrupt Mask Mask */
#define ADC_IMR_RXFULL(value)                 (ADC_IMR_RXFULL_Msk & (_UINT32_(value) << ADC_IMR_RXFULL_Pos)) /* Assigment of value for RXFULL in the ADC_IMR register */
#define ADC_IMR_RXCHUNK_Pos                   _UINT32_(3)                                          /* (ADC_IMR) Receive FIFO Chunk Interrupt Mask Position */
#define ADC_IMR_RXCHUNK_Msk                   (_UINT32_(0x1) << ADC_IMR_RXCHUNK_Pos)               /* (ADC_IMR) Receive FIFO Chunk Interrupt Mask Mask */
#define ADC_IMR_RXCHUNK(value)                (ADC_IMR_RXCHUNK_Msk & (_UINT32_(value) << ADC_IMR_RXCHUNK_Pos)) /* Assigment of value for RXCHUNK in the ADC_IMR register */
#define ADC_IMR_RXUDR_Pos                     _UINT32_(4)                                          /* (ADC_IMR) Receive Under Flow Interrupt Mask Position */
#define ADC_IMR_RXUDR_Msk                     (_UINT32_(0x1) << ADC_IMR_RXUDR_Pos)                 /* (ADC_IMR) Receive Under Flow Interrupt Mask Mask */
#define ADC_IMR_RXUDR(value)                  (ADC_IMR_RXUDR_Msk & (_UINT32_(value) << ADC_IMR_RXUDR_Pos)) /* Assigment of value for RXUDR in the ADC_IMR register */
#define ADC_IMR_RXOVR_Pos                     _UINT32_(5)                                          /* (ADC_IMR) Receive Over Flow Interrupt Mask Position */
#define ADC_IMR_RXOVR_Msk                     (_UINT32_(0x1) << ADC_IMR_RXOVR_Pos)                 /* (ADC_IMR) Receive Over Flow Interrupt Mask Mask */
#define ADC_IMR_RXOVR(value)                  (ADC_IMR_RXOVR_Msk & (_UINT32_(value) << ADC_IMR_RXOVR_Pos)) /* Assigment of value for RXOVR in the ADC_IMR register */
#define ADC_IMR_SMEV_Pos                      _UINT32_(6)                                          /* (ADC_IMR) Supply Monitor Event Interrupt Mask Position */
#define ADC_IMR_SMEV_Msk                      (_UINT32_(0x1) << ADC_IMR_SMEV_Pos)                  /* (ADC_IMR) Supply Monitor Event Interrupt Mask Mask */
#define ADC_IMR_SMEV(value)                   (ADC_IMR_SMEV_Msk & (_UINT32_(value) << ADC_IMR_SMEV_Pos)) /* Assigment of value for SMEV in the ADC_IMR register */
#define ADC_IMR_EOS_Pos                       _UINT32_(18)                                         /* (ADC_IMR) End Of Sequence Interrupt Mask Position */
#define ADC_IMR_EOS_Msk                       (_UINT32_(0x1) << ADC_IMR_EOS_Pos)                   /* (ADC_IMR) End Of Sequence Interrupt Mask Mask */
#define ADC_IMR_EOS(value)                    (ADC_IMR_EOS_Msk & (_UINT32_(value) << ADC_IMR_EOS_Pos)) /* Assigment of value for EOS in the ADC_IMR register */
#define ADC_IMR_TEMPCHG_Pos                   _UINT32_(19)                                         /* (ADC_IMR) Temperature Change Interrupt Mask Position */
#define ADC_IMR_TEMPCHG_Msk                   (_UINT32_(0x1) << ADC_IMR_TEMPCHG_Pos)               /* (ADC_IMR) Temperature Change Interrupt Mask Mask */
#define ADC_IMR_TEMPCHG(value)                (ADC_IMR_TEMPCHG_Msk & (_UINT32_(value) << ADC_IMR_TEMPCHG_Pos)) /* Assigment of value for TEMPCHG in the ADC_IMR register */
#define ADC_IMR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IMR) Data Ready Interrupt Mask Position */
#define ADC_IMR_DRDY_Msk                      (_UINT32_(0x1) << ADC_IMR_DRDY_Pos)                  /* (ADC_IMR) Data Ready Interrupt Mask Mask */
#define ADC_IMR_DRDY(value)                   (ADC_IMR_DRDY_Msk & (_UINT32_(value) << ADC_IMR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IMR register */
#define ADC_IMR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IMR) General Overrun Error Interrupt Mask Position */
#define ADC_IMR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IMR_GOVRE_Pos)                 /* (ADC_IMR) General Overrun Error Interrupt Mask Mask */
#define ADC_IMR_GOVRE(value)                  (ADC_IMR_GOVRE_Msk & (_UINT32_(value) << ADC_IMR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IMR register */
#define ADC_IMR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IMR) Comparison Event Interrupt Mask Position */
#define ADC_IMR_COMPE_Msk                     (_UINT32_(0x1) << ADC_IMR_COMPE_Pos)                 /* (ADC_IMR) Comparison Event Interrupt Mask Mask */
#define ADC_IMR_COMPE(value)                  (ADC_IMR_COMPE_Msk & (_UINT32_(value) << ADC_IMR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IMR register */
#define ADC_IMR_ENDRX_Pos                     _UINT32_(27)                                         /* (ADC_IMR) End of Receive Transfer Interrupt Mask Position */
#define ADC_IMR_ENDRX_Msk                     (_UINT32_(0x1) << ADC_IMR_ENDRX_Pos)                 /* (ADC_IMR) End of Receive Transfer Interrupt Mask Mask */
#define ADC_IMR_ENDRX(value)                  (ADC_IMR_ENDRX_Msk & (_UINT32_(value) << ADC_IMR_ENDRX_Pos)) /* Assigment of value for ENDRX in the ADC_IMR register */
#define ADC_IMR_RXBUFF_Pos                    _UINT32_(28)                                         /* (ADC_IMR) Receive Buffer Full Interrupt Mask Position */
#define ADC_IMR_RXBUFF_Msk                    (_UINT32_(0x1) << ADC_IMR_RXBUFF_Pos)                /* (ADC_IMR) Receive Buffer Full Interrupt Mask Mask */
#define ADC_IMR_RXBUFF(value)                 (ADC_IMR_RXBUFF_Msk & (_UINT32_(value) << ADC_IMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the ADC_IMR register */
#define ADC_IMR_Msk                           _UINT32_(0x1F0C007F)                                 /* (ADC_IMR) Register Mask  */


/* -------- ADC_ISR : (ADC Offset: 0x30) ( R/ 32) Interrupt Status Register -------- */
#define ADC_ISR_RXRDY_Pos                     _UINT32_(0)                                          /* (ADC_ISR) Receive Ready (cleared on read) Position */
#define ADC_ISR_RXRDY_Msk                     (_UINT32_(0x1) << ADC_ISR_RXRDY_Pos)                 /* (ADC_ISR) Receive Ready (cleared on read) Mask */
#define ADC_ISR_RXRDY(value)                  (ADC_ISR_RXRDY_Msk & (_UINT32_(value) << ADC_ISR_RXRDY_Pos)) /* Assigment of value for RXRDY in the ADC_ISR register */
#define ADC_ISR_RXEMPTY_Pos                   _UINT32_(1)                                          /* (ADC_ISR) Receive FIFO Empty (cleared on read) Position */
#define ADC_ISR_RXEMPTY_Msk                   (_UINT32_(0x1) << ADC_ISR_RXEMPTY_Pos)               /* (ADC_ISR) Receive FIFO Empty (cleared on read) Mask */
#define ADC_ISR_RXEMPTY(value)                (ADC_ISR_RXEMPTY_Msk & (_UINT32_(value) << ADC_ISR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the ADC_ISR register */
#define ADC_ISR_RXFULL_Pos                    _UINT32_(2)                                          /* (ADC_ISR) Receive FIFO Full (cleared on read) Position */
#define ADC_ISR_RXFULL_Msk                    (_UINT32_(0x1) << ADC_ISR_RXFULL_Pos)                /* (ADC_ISR) Receive FIFO Full (cleared on read) Mask */
#define ADC_ISR_RXFULL(value)                 (ADC_ISR_RXFULL_Msk & (_UINT32_(value) << ADC_ISR_RXFULL_Pos)) /* Assigment of value for RXFULL in the ADC_ISR register */
#define ADC_ISR_RXCHUNK_Pos                   _UINT32_(3)                                          /* (ADC_ISR) Receive FIFO Chunk (cleared on read) Position */
#define ADC_ISR_RXCHUNK_Msk                   (_UINT32_(0x1) << ADC_ISR_RXCHUNK_Pos)               /* (ADC_ISR) Receive FIFO Chunk (cleared on read) Mask */
#define ADC_ISR_RXCHUNK(value)                (ADC_ISR_RXCHUNK_Msk & (_UINT32_(value) << ADC_ISR_RXCHUNK_Pos)) /* Assigment of value for RXCHUNK in the ADC_ISR register */
#define ADC_ISR_RXUDR_Pos                     _UINT32_(4)                                          /* (ADC_ISR) Receive Under Flow (cleared on read) Position */
#define ADC_ISR_RXUDR_Msk                     (_UINT32_(0x1) << ADC_ISR_RXUDR_Pos)                 /* (ADC_ISR) Receive Under Flow (cleared on read) Mask */
#define ADC_ISR_RXUDR(value)                  (ADC_ISR_RXUDR_Msk & (_UINT32_(value) << ADC_ISR_RXUDR_Pos)) /* Assigment of value for RXUDR in the ADC_ISR register */
#define ADC_ISR_RXOVR_Pos                     _UINT32_(5)                                          /* (ADC_ISR) Receive Over Flow (cleared on read) Position */
#define ADC_ISR_RXOVR_Msk                     (_UINT32_(0x1) << ADC_ISR_RXOVR_Pos)                 /* (ADC_ISR) Receive Over Flow (cleared on read) Mask */
#define ADC_ISR_RXOVR(value)                  (ADC_ISR_RXOVR_Msk & (_UINT32_(value) << ADC_ISR_RXOVR_Pos)) /* Assigment of value for RXOVR in the ADC_ISR register */
#define ADC_ISR_SMEV_Pos                      _UINT32_(6)                                          /* (ADC_ISR) Supply Monitor Event (cleared on read) Position */
#define ADC_ISR_SMEV_Msk                      (_UINT32_(0x1) << ADC_ISR_SMEV_Pos)                  /* (ADC_ISR) Supply Monitor Event (cleared on read) Mask */
#define ADC_ISR_SMEV(value)                   (ADC_ISR_SMEV_Msk & (_UINT32_(value) << ADC_ISR_SMEV_Pos)) /* Assigment of value for SMEV in the ADC_ISR register */
#define ADC_ISR_EOS_Pos                       _UINT32_(18)                                         /* (ADC_ISR) End Of Sequence (cleared on read) Position */
#define ADC_ISR_EOS_Msk                       (_UINT32_(0x1) << ADC_ISR_EOS_Pos)                   /* (ADC_ISR) End Of Sequence (cleared on read) Mask */
#define ADC_ISR_EOS(value)                    (ADC_ISR_EOS_Msk & (_UINT32_(value) << ADC_ISR_EOS_Pos)) /* Assigment of value for EOS in the ADC_ISR register */
#define ADC_ISR_TEMPCHG_Pos                   _UINT32_(19)                                         /* (ADC_ISR) Temperature Change (cleared on read) Position */
#define ADC_ISR_TEMPCHG_Msk                   (_UINT32_(0x1) << ADC_ISR_TEMPCHG_Pos)               /* (ADC_ISR) Temperature Change (cleared on read) Mask */
#define ADC_ISR_TEMPCHG(value)                (ADC_ISR_TEMPCHG_Msk & (_UINT32_(value) << ADC_ISR_TEMPCHG_Pos)) /* Assigment of value for TEMPCHG in the ADC_ISR register */
#define ADC_ISR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_ISR) Data Ready (automatically set / cleared) Position */
#define ADC_ISR_DRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_DRDY_Pos)                  /* (ADC_ISR) Data Ready (automatically set / cleared) Mask */
#define ADC_ISR_DRDY(value)                   (ADC_ISR_DRDY_Msk & (_UINT32_(value) << ADC_ISR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_ISR register */
#define ADC_ISR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_ISR) General Overrun Error (cleared on read) Position */
#define ADC_ISR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_ISR_GOVRE_Pos)                 /* (ADC_ISR) General Overrun Error (cleared on read) Mask */
#define ADC_ISR_GOVRE(value)                  (ADC_ISR_GOVRE_Msk & (_UINT32_(value) << ADC_ISR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_ISR register */
#define ADC_ISR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_ISR) Comparison Event (cleared on read) Position */
#define ADC_ISR_COMPE_Msk                     (_UINT32_(0x1) << ADC_ISR_COMPE_Pos)                 /* (ADC_ISR) Comparison Event (cleared on read) Mask */
#define ADC_ISR_COMPE(value)                  (ADC_ISR_COMPE_Msk & (_UINT32_(value) << ADC_ISR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_ISR register */
#define ADC_ISR_ENDRX_Pos                     _UINT32_(27)                                         /* (ADC_ISR) End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) Position */
#define ADC_ISR_ENDRX_Msk                     (_UINT32_(0x1) << ADC_ISR_ENDRX_Pos)                 /* (ADC_ISR) End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR) Mask */
#define ADC_ISR_ENDRX(value)                  (ADC_ISR_ENDRX_Msk & (_UINT32_(value) << ADC_ISR_ENDRX_Pos)) /* Assigment of value for ENDRX in the ADC_ISR register */
#define ADC_ISR_RXBUFF_Pos                    _UINT32_(28)                                         /* (ADC_ISR) Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) Position */
#define ADC_ISR_RXBUFF_Msk                    (_UINT32_(0x1) << ADC_ISR_RXBUFF_Pos)                /* (ADC_ISR) Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR) Mask */
#define ADC_ISR_RXBUFF(value)                 (ADC_ISR_RXBUFF_Msk & (_UINT32_(value) << ADC_ISR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the ADC_ISR register */
#define ADC_ISR_Msk                           _UINT32_(0x1F0C007F)                                 /* (ADC_ISR) Register Mask  */


/* -------- ADC_EOC_IER : (ADC Offset: 0x34) ( /W 32) End Of Conversion Interrupt Enable Register -------- */
#define ADC_EOC_IER_EOC0_Pos                  _UINT32_(0)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 0 Position */
#define ADC_EOC_IER_EOC0_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC0_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 0 Mask */
#define ADC_EOC_IER_EOC0(value)               (ADC_EOC_IER_EOC0_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC1_Pos                  _UINT32_(1)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 1 Position */
#define ADC_EOC_IER_EOC1_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC1_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 1 Mask */
#define ADC_EOC_IER_EOC1(value)               (ADC_EOC_IER_EOC1_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC2_Pos                  _UINT32_(2)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 2 Position */
#define ADC_EOC_IER_EOC2_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC2_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 2 Mask */
#define ADC_EOC_IER_EOC2(value)               (ADC_EOC_IER_EOC2_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC3_Pos                  _UINT32_(3)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 3 Position */
#define ADC_EOC_IER_EOC3_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC3_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 3 Mask */
#define ADC_EOC_IER_EOC3(value)               (ADC_EOC_IER_EOC3_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC4_Pos                  _UINT32_(4)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 4 Position */
#define ADC_EOC_IER_EOC4_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC4_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 4 Mask */
#define ADC_EOC_IER_EOC4(value)               (ADC_EOC_IER_EOC4_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC5_Pos                  _UINT32_(5)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 5 Position */
#define ADC_EOC_IER_EOC5_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC5_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 5 Mask */
#define ADC_EOC_IER_EOC5(value)               (ADC_EOC_IER_EOC5_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC6_Pos                  _UINT32_(6)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 6 Position */
#define ADC_EOC_IER_EOC6_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC6_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 6 Mask */
#define ADC_EOC_IER_EOC6(value)               (ADC_EOC_IER_EOC6_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_EOC_IER register */
#define ADC_EOC_IER_EOC7_Pos                  _UINT32_(7)                                          /* (ADC_EOC_IER) End of Conversion Interrupt Enable 7 Position */
#define ADC_EOC_IER_EOC7_Msk                  (_UINT32_(0x1) << ADC_EOC_IER_EOC7_Pos)              /* (ADC_EOC_IER) End of Conversion Interrupt Enable 7 Mask */
#define ADC_EOC_IER_EOC7(value)               (ADC_EOC_IER_EOC7_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_EOC_IER register */
#define ADC_EOC_IER_Msk                       _UINT32_(0x000000FF)                                 /* (ADC_EOC_IER) Register Mask  */

#define ADC_EOC_IER_EOC_Pos                   _UINT32_(0)                                          /* (ADC_EOC_IER Position) End of Conversion Interrupt Enable 7 */
#define ADC_EOC_IER_EOC_Msk                   (_UINT32_(0xFF) << ADC_EOC_IER_EOC_Pos)              /* (ADC_EOC_IER Mask) EOC */
#define ADC_EOC_IER_EOC(value)                (ADC_EOC_IER_EOC_Msk & (_UINT32_(value) << ADC_EOC_IER_EOC_Pos)) 

/* -------- ADC_EOC_IDR : (ADC Offset: 0x38) ( /W 32) End Of Conversion Interrupt Disable Register -------- */
#define ADC_EOC_IDR_EOC0_Pos                  _UINT32_(0)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 0 Position */
#define ADC_EOC_IDR_EOC0_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC0_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define ADC_EOC_IDR_EOC0(value)               (ADC_EOC_IDR_EOC0_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC1_Pos                  _UINT32_(1)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 1 Position */
#define ADC_EOC_IDR_EOC1_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC1_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define ADC_EOC_IDR_EOC1(value)               (ADC_EOC_IDR_EOC1_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC2_Pos                  _UINT32_(2)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 2 Position */
#define ADC_EOC_IDR_EOC2_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC2_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define ADC_EOC_IDR_EOC2(value)               (ADC_EOC_IDR_EOC2_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC3_Pos                  _UINT32_(3)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 3 Position */
#define ADC_EOC_IDR_EOC3_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC3_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define ADC_EOC_IDR_EOC3(value)               (ADC_EOC_IDR_EOC3_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC4_Pos                  _UINT32_(4)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 4 Position */
#define ADC_EOC_IDR_EOC4_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC4_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define ADC_EOC_IDR_EOC4(value)               (ADC_EOC_IDR_EOC4_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC5_Pos                  _UINT32_(5)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 5 Position */
#define ADC_EOC_IDR_EOC5_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC5_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define ADC_EOC_IDR_EOC5(value)               (ADC_EOC_IDR_EOC5_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC6_Pos                  _UINT32_(6)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 6 Position */
#define ADC_EOC_IDR_EOC6_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC6_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define ADC_EOC_IDR_EOC6(value)               (ADC_EOC_IDR_EOC6_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_EOC7_Pos                  _UINT32_(7)                                          /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 7 Position */
#define ADC_EOC_IDR_EOC7_Msk                  (_UINT32_(0x1) << ADC_EOC_IDR_EOC7_Pos)              /* (ADC_EOC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define ADC_EOC_IDR_EOC7(value)               (ADC_EOC_IDR_EOC7_Msk & (_UINT32_(value) << ADC_EOC_IDR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_EOC_IDR register */
#define ADC_EOC_IDR_Msk                       _UINT32_(0x000000FF)                                 /* (ADC_EOC_IDR) Register Mask  */

