Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_bin/prime_1_3_service_bin/firmware/src/packs/PIC32CX2051MTG128_DFP/component/adc.h
/* -------- ADC_CCR : (ADC Offset: 0x5C) (R/W 32) Channel Configuration Register -------- */
#define ADC_CCR_DIFF0_Pos                     _UINT32_(0)                                          /* (ADC_CCR) Differential Inputs for Channel 0 Position */
#define ADC_CCR_DIFF0_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF0_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 0 Mask */
#define ADC_CCR_DIFF0(value)                  (ADC_CCR_DIFF0_Msk & (_UINT32_(value) << ADC_CCR_DIFF0_Pos)) /* Assigment of value for DIFF0 in the ADC_CCR register */
#define ADC_CCR_DIFF1_Pos                     _UINT32_(1)                                          /* (ADC_CCR) Differential Inputs for Channel 1 Position */
#define ADC_CCR_DIFF1_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF1_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 1 Mask */
#define ADC_CCR_DIFF1(value)                  (ADC_CCR_DIFF1_Msk & (_UINT32_(value) << ADC_CCR_DIFF1_Pos)) /* Assigment of value for DIFF1 in the ADC_CCR register */
#define ADC_CCR_DIFF2_Pos                     _UINT32_(2)                                          /* (ADC_CCR) Differential Inputs for Channel 2 Position */
#define ADC_CCR_DIFF2_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF2_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 2 Mask */
#define ADC_CCR_DIFF2(value)                  (ADC_CCR_DIFF2_Msk & (_UINT32_(value) << ADC_CCR_DIFF2_Pos)) /* Assigment of value for DIFF2 in the ADC_CCR register */
#define ADC_CCR_DIFF3_Pos                     _UINT32_(3)                                          /* (ADC_CCR) Differential Inputs for Channel 3 Position */
#define ADC_CCR_DIFF3_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF3_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 3 Mask */
#define ADC_CCR_DIFF3(value)                  (ADC_CCR_DIFF3_Msk & (_UINT32_(value) << ADC_CCR_DIFF3_Pos)) /* Assigment of value for DIFF3 in the ADC_CCR register */
#define ADC_CCR_DIFF4_Pos                     _UINT32_(4)                                          /* (ADC_CCR) Differential Inputs for Channel 4 Position */
#define ADC_CCR_DIFF4_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF4_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 4 Mask */
#define ADC_CCR_DIFF4(value)                  (ADC_CCR_DIFF4_Msk & (_UINT32_(value) << ADC_CCR_DIFF4_Pos)) /* Assigment of value for DIFF4 in the ADC_CCR register */
#define ADC_CCR_DIFF5_Pos                     _UINT32_(5)                                          /* (ADC_CCR) Differential Inputs for Channel 5 Position */
#define ADC_CCR_DIFF5_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF5_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 5 Mask */
#define ADC_CCR_DIFF5(value)                  (ADC_CCR_DIFF5_Msk & (_UINT32_(value) << ADC_CCR_DIFF5_Pos)) /* Assigment of value for DIFF5 in the ADC_CCR register */
#define ADC_CCR_DIFF6_Pos                     _UINT32_(6)                                          /* (ADC_CCR) Differential Inputs for Channel 6 Position */
#define ADC_CCR_DIFF6_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF6_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 6 Mask */
#define ADC_CCR_DIFF6(value)                  (ADC_CCR_DIFF6_Msk & (_UINT32_(value) << ADC_CCR_DIFF6_Pos)) /* Assigment of value for DIFF6 in the ADC_CCR register */
#define ADC_CCR_DIFF7_Pos                     _UINT32_(7)                                          /* (ADC_CCR) Differential Inputs for Channel 7 Position */
#define ADC_CCR_DIFF7_Msk                     (_UINT32_(0x1) << ADC_CCR_DIFF7_Pos)                 /* (ADC_CCR) Differential Inputs for Channel 7 Mask */
#define ADC_CCR_DIFF7(value)                  (ADC_CCR_DIFF7_Msk & (_UINT32_(value) << ADC_CCR_DIFF7_Pos)) /* Assigment of value for DIFF7 in the ADC_CCR register */
#define ADC_CCR_Msk                           _UINT32_(0x000000FF)                                 /* (ADC_CCR) Register Mask  */

#define ADC_CCR_DIFF_Pos                      _UINT32_(0)                                          /* (ADC_CCR Position) Differential Inputs for Channel 7 */
#define ADC_CCR_DIFF_Msk                      (_UINT32_(0xFF) << ADC_CCR_DIFF_Pos)                 /* (ADC_CCR Mask) DIFF */
#define ADC_CCR_DIFF(value)                   (ADC_CCR_DIFF_Msk & (_UINT32_(value) << ADC_CCR_DIFF_Pos)) 

/* -------- ADC_CDR : (ADC Offset: 0x60) ( R/ 32) Channel Data Register -------- */
#define ADC_CDR_DATA_Pos                      _UINT32_(0)                                          /* (ADC_CDR) Converted Data Position */
#define ADC_CDR_DATA_Msk                      (_UINT32_(0xFFFF) << ADC_CDR_DATA_Pos)               /* (ADC_CDR) Converted Data Mask */
#define ADC_CDR_DATA(value)                   (ADC_CDR_DATA_Msk & (_UINT32_(value) << ADC_CDR_DATA_Pos)) /* Assigment of value for DATA in the ADC_CDR register */
#define ADC_CDR_Msk                           _UINT32_(0x0000FFFF)                                 /* (ADC_CDR) Register Mask  */


/* -------- ADC_ACR : (ADC Offset: 0xE0) (R/W 32) Analog Control Register -------- */
#define ADC_ACR_ZBAT_Pos                      _UINT32_(2)                                          /* (ADC_ACR) VBAT Resistive Load Selection Position */
#define ADC_ACR_ZBAT_Msk                      (_UINT32_(0x1) << ADC_ACR_ZBAT_Pos)                  /* (ADC_ACR) VBAT Resistive Load Selection Mask */
#define ADC_ACR_ZBAT(value)                   (ADC_ACR_ZBAT_Msk & (_UINT32_(value) << ADC_ACR_ZBAT_Pos)) /* Assigment of value for ZBAT in the ADC_ACR register */
#define ADC_ACR_INTVREFEN_Pos                 _UINT32_(20)                                         /* (ADC_ACR) ADC Internal Positive Voltage Reference Enable Position */
#define ADC_ACR_INTVREFEN_Msk                 (_UINT32_(0x1) << ADC_ACR_INTVREFEN_Pos)             /* (ADC_ACR) ADC Internal Positive Voltage Reference Enable Mask */
#define ADC_ACR_INTVREFEN(value)              (ADC_ACR_INTVREFEN_Msk & (_UINT32_(value) << ADC_ACR_INTVREFEN_Pos)) /* Assigment of value for INTVREFEN in the ADC_ACR register */
#define ADC_ACR_SMEN_Pos                      _UINT32_(21)                                         /* (ADC_ACR) Supply Monitor Enable Position */
#define ADC_ACR_SMEN_Msk                      (_UINT32_(0x1) << ADC_ACR_SMEN_Pos)                  /* (ADC_ACR) Supply Monitor Enable Mask */
#define ADC_ACR_SMEN(value)                   (ADC_ACR_SMEN_Msk & (_UINT32_(value) << ADC_ACR_SMEN_Pos)) /* Assigment of value for SMEN in the ADC_ACR register */
#define ADC_ACR_SMVT_Pos                      _UINT32_(22)                                         /* (ADC_ACR) Supply Monitor Voltage Threshold Position */
#define ADC_ACR_SMVT_Msk                      (_UINT32_(0x1) << ADC_ACR_SMVT_Pos)                  /* (ADC_ACR) Supply Monitor Voltage Threshold Mask */
#define ADC_ACR_SMVT(value)                   (ADC_ACR_SMVT_Msk & (_UINT32_(value) << ADC_ACR_SMVT_Pos)) /* Assigment of value for SMVT in the ADC_ACR register */
#define ADC_ACR_Msk                           _UINT32_(0x00700004)                                 /* (ADC_ACR) Register Mask  */


/* -------- ADC_FMR : (ADC Offset: 0xE4) (R/W 32) FIFO Mode Register -------- */
#define ADC_FMR_ENFIFO_Pos                    _UINT32_(0)                                          /* (ADC_FMR) Enable FIFO Position */
#define ADC_FMR_ENFIFO_Msk                    (_UINT32_(0x1) << ADC_FMR_ENFIFO_Pos)                /* (ADC_FMR) Enable FIFO Mask */
#define ADC_FMR_ENFIFO(value)                 (ADC_FMR_ENFIFO_Msk & (_UINT32_(value) << ADC_FMR_ENFIFO_Pos)) /* Assigment of value for ENFIFO in the ADC_FMR register */
#define   ADC_FMR_ENFIFO_0_Val                _UINT32_(0x0)                                        /* (ADC_FMR) FIFO is disabled.  */
#define   ADC_FMR_ENFIFO_1_Val                _UINT32_(0x1)                                        /* (ADC_FMR) FIFO is enabled.  */
#define ADC_FMR_ENFIFO_0                      (ADC_FMR_ENFIFO_0_Val << ADC_FMR_ENFIFO_Pos)         /* (ADC_FMR) FIFO is disabled. Position  */
#define ADC_FMR_ENFIFO_1                      (ADC_FMR_ENFIFO_1_Val << ADC_FMR_ENFIFO_Pos)         /* (ADC_FMR) FIFO is enabled. Position  */
#define ADC_FMR_ENLEVEL_Pos                   _UINT32_(1)                                          /* (ADC_FMR) Enable Level Position */
#define ADC_FMR_ENLEVEL_Msk                   (_UINT32_(0x1) << ADC_FMR_ENLEVEL_Pos)               /* (ADC_FMR) Enable Level Mask */
#define ADC_FMR_ENLEVEL(value)                (ADC_FMR_ENLEVEL_Msk & (_UINT32_(value) << ADC_FMR_ENLEVEL_Pos)) /* Assigment of value for ENLEVEL in the ADC_FMR register */
#define   ADC_FMR_ENLEVEL_0_Val               _UINT32_(0x0)                                        /* (ADC_FMR) Request to DMA is generated as soon as one data is written in FIFO when FIFO is enabled. CHUNK is not used.  */
#define   ADC_FMR_ENLEVEL_1_Val               _UINT32_(0x1)                                        /* (ADC_FMR) Request to DMA is generated as soon as the number of written elements in the FIFO is greater than or equal to CHUNK.  */
#define ADC_FMR_ENLEVEL_0                     (ADC_FMR_ENLEVEL_0_Val << ADC_FMR_ENLEVEL_Pos)       /* (ADC_FMR) Request to DMA is generated as soon as one data is written in FIFO when FIFO is enabled. CHUNK is not used. Position  */
#define ADC_FMR_ENLEVEL_1                     (ADC_FMR_ENLEVEL_1_Val << ADC_FMR_ENLEVEL_Pos)       /* (ADC_FMR) Request to DMA is generated as soon as the number of written elements in the FIFO is greater than or equal to CHUNK. Position  */
#define ADC_FMR_CHUNK_Pos                     _UINT32_(4)                                          /* (ADC_FMR) Chunk Size Position */
#define ADC_FMR_CHUNK_Msk                     (_UINT32_(0xF) << ADC_FMR_CHUNK_Pos)                 /* (ADC_FMR) Chunk Size Mask */
#define ADC_FMR_CHUNK(value)                  (ADC_FMR_CHUNK_Msk & (_UINT32_(value) << ADC_FMR_CHUNK_Pos)) /* Assigment of value for CHUNK in the ADC_FMR register */
#define ADC_FMR_FIFOCNT_Pos                   _UINT32_(16)                                         /* (ADC_FMR) FIFO Count (read-only) Position */
#define ADC_FMR_FIFOCNT_Msk                   (_UINT32_(0xFF) << ADC_FMR_FIFOCNT_Pos)              /* (ADC_FMR) FIFO Count (read-only) Mask */
#define ADC_FMR_FIFOCNT(value)                (ADC_FMR_FIFOCNT_Msk & (_UINT32_(value) << ADC_FMR_FIFOCNT_Pos)) /* Assigment of value for FIFOCNT in the ADC_FMR register */
#define ADC_FMR_Msk                           _UINT32_(0x00FF00F3)                                 /* (ADC_FMR) Register Mask  */


/* -------- ADC_RPR : (ADC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define ADC_RPR_RXPTR_Pos                     _UINT32_(0)                                          /* (ADC_RPR) Receive Pointer Register Position */
#define ADC_RPR_RXPTR_Msk                     (_UINT32_(0xFFFFFFFF) << ADC_RPR_RXPTR_Pos)          /* (ADC_RPR) Receive Pointer Register Mask */
#define ADC_RPR_RXPTR(value)                  (ADC_RPR_RXPTR_Msk & (_UINT32_(value) << ADC_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the ADC_RPR register */
#define ADC_RPR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ADC_RPR) Register Mask  */


/* -------- ADC_RCR : (ADC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define ADC_RCR_RXCTR_Pos                     _UINT32_(0)                                          /* (ADC_RCR) Receive Counter Register Position */
#define ADC_RCR_RXCTR_Msk                     (_UINT32_(0xFFFF) << ADC_RCR_RXCTR_Pos)              /* (ADC_RCR) Receive Counter Register Mask */
#define ADC_RCR_RXCTR(value)                  (ADC_RCR_RXCTR_Msk & (_UINT32_(value) << ADC_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the ADC_RCR register */
#define ADC_RCR_Msk                           _UINT32_(0x0000FFFF)                                 /* (ADC_RCR) Register Mask  */


/* -------- ADC_RNPR : (ADC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define ADC_RNPR_RXNPTR_Pos                   _UINT32_(0)                                          /* (ADC_RNPR) Receive Next Pointer Position */
#define ADC_RNPR_RXNPTR_Msk                   (_UINT32_(0xFFFFFFFF) << ADC_RNPR_RXNPTR_Pos)        /* (ADC_RNPR) Receive Next Pointer Mask */
#define ADC_RNPR_RXNPTR(value)                (ADC_RNPR_RXNPTR_Msk & (_UINT32_(value) << ADC_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the ADC_RNPR register */
#define ADC_RNPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ADC_RNPR) Register Mask  */


