Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_bin/prime_1_3_service_bin/firmware/src/packs/PIC32CX2051MTG128_DFP/component/adc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ADC register API structure */
typedef struct
{
  __O   uint32_t                       ADC_CR;             /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       ADC_MR;             /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       ADC_SEQR1;          /**< Offset: 0x08 (R/W  32) Channel Sequence Register 1 */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       ADC_CHER;           /**< Offset: 0x10 ( /W  32) Channel Enable Register */
  __O   uint32_t                       ADC_CHDR;           /**< Offset: 0x14 ( /W  32) Channel Disable Register */
  __I   uint32_t                       ADC_CHSR;           /**< Offset: 0x18 (R/   32) Channel Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       ADC_LCDR;           /**< Offset: 0x20 (R/   32) Last Converted Data Register */
  __O   uint32_t                       ADC_IER;            /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       ADC_IDR;            /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       ADC_IMR;            /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       ADC_ISR;            /**< Offset: 0x30 (R/   32) Interrupt Status Register */
  __O   uint32_t                       ADC_EOC_IER;        /**< Offset: 0x34 ( /W  32) End Of Conversion Interrupt Enable Register */
  __O   uint32_t                       ADC_EOC_IDR;        /**< Offset: 0x38 ( /W  32) End Of Conversion Interrupt Disable Register */
  __I   uint32_t                       ADC_EOC_IMR;        /**< Offset: 0x3C (R/   32) End Of Conversion Interrupt Mask Register */
  __I   uint32_t                       ADC_EOC_ISR;        /**< Offset: 0x40 (R/   32) End Of Conversion Interrupt Status Register */
  __IO  uint32_t                       ADC_TEMPMR;         /**< Offset: 0x44 (R/W  32) Temperature Sensor Mode Register */
  __IO  uint32_t                       ADC_TEMPCWR;        /**< Offset: 0x48 (R/W  32) Temperature Compare Window Register */
  __I   uint32_t                       ADC_OVER;           /**< Offset: 0x4C (R/   32) Overrun Status Register */
  __IO  uint32_t                       ADC_EMR;            /**< Offset: 0x50 (R/W  32) Extended Mode Register */
  __IO  uint32_t                       ADC_CWR;            /**< Offset: 0x54 (R/W  32) Compare Window Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       ADC_CCR;            /**< Offset: 0x5C (R/W  32) Channel Configuration Register */
  __I   uint32_t                       ADC_CDR[8];         /**< Offset: 0x60 (R/   32) Channel Data Register */
  __I   uint8_t                        Reserved4[0x60];
  __IO  uint32_t                       ADC_ACR;            /**< Offset: 0xE0 (R/W  32) Analog Control Register */
  __IO  uint32_t                       ADC_FMR;            /**< Offset: 0xE4 (R/W  32) FIFO Mode Register */
  __I   uint8_t                        Reserved5[0x18];
  __IO  uint32_t                       ADC_RPR;            /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       ADC_RCR;            /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __I   uint8_t                        Reserved6[0x08];
  __IO  uint32_t                       ADC_RNPR;           /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       ADC_RNCR;           /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __I   uint8_t                        Reserved7[0x08];
  __O   uint32_t                       ADC_PTCR;           /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       ADC_PTSR;           /**< Offset: 0x124 (R/   32) Transfer Status Register */
  __IO  uint32_t                       ADC_PWPMR;          /**< Offset: 0x128 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       ADC_TRGR;           /**< Offset: 0x130 (R/W  32) Trigger Register */
  __IO  uint32_t                       ADC_COSR;           /**< Offset: 0x134 (R/W  32) Correction Select Register */
  __IO  uint32_t                       ADC_CVR;            /**< Offset: 0x138 (R/W  32) Correction Values Register */
  __IO  uint32_t                       ADC_CECR;           /**< Offset: 0x13C (R/W  32) Channel Error Correction Register */
  __I   uint8_t                        Reserved9[0x04];
  __I   uint32_t                       ADC_SR;             /**< Offset: 0x144 (R/   32) Status Register */
  __I   uint8_t                        Reserved10[0x04];
  __IO  uint32_t                       ADC_WPMR;           /**< Offset: 0x14C (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       ADC_WPSR;           /**< Offset: 0x150 (R/   32) Write Protection Status Register */
} adc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTG_ADC_COMPONENT_H_ */
